zevorn/qemu/hw/misc/stm32g474_rcc.c
/*
 * STM32G474 reset and clock control
 *
 * Copyright (c) 2026 Process Mission
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "hw/core/irq.h"
#include "hw/core/qdev-clock.h"
#include "hw/misc/stm32g474_rcc.h"
#include "hw/core/registerfields.h"
#include "migration/vmstate.h"
#include "qemu/bitops.h"
#include "qemu/log.h"
#include "qemu/module.h"

REG32(CR, 0x00)
    FIELD(CR, HSION, 8, 1)
    FIELD(CR, HSIKERON, 9, 1)
    FIELD(CR, HSIRDY, 10, 1)
    FIELD(CR, HSEON, 16, 1)
    FIELD(CR, HSERDY, 17, 1)
    FIELD(CR, HSEBYP, 18, 1)
    FIELD(CR, CSSON, 19, 1)
    FIELD(CR, PLLON, 24, 1)
    FIELD(CR, PLLRDY, 25, 1)
REG32(ICSCR, 0x04)
    FIELD(ICSCR, HSICAL, 16, 8)
    FIELD(ICSCR, HSITRIM, 24, 7)
REG32(CFGR, 0x08)
    FIELD(CFGR, SW, 0, 2)
    FIELD(CFGR, SWS, 2, 2)
    FIELD(CFGR, HPRE, 4, 4)
    FIELD(CFGR, PPRE1, 8, 3)
    FIELD(CFGR, PPRE2, 11, 3)
    FIELD(CFGR, MCOSEL, 24, 4)
    FIELD(CFGR, MCOPRE, 28, 3)
REG32(PLLCFGR, 0x0c)
    FIELD(PLLCFGR, PLLSRC, 0, 2)
    FIELD(PLLCFGR, PLLM, 4, 4)
    FIELD(PLLCFGR, PLLN, 8, 7)
    FIELD(PLLCFGR, PLLPEN, 16, 1)
    FIELD(PLLCFGR, PLLP, 17, 1)
    FIELD(PLLCFGR, PLLQEN, 20, 1)
    FIELD(PLLCFGR, PLLQ, 21, 2)
    FIELD(PLLCFGR, PLLREN, 24, 1)
    FIELD(PLLCFGR, PLLR, 25, 2)
    FIELD(PLLCFGR, PLLPDIV, 27, 5)
REG32(CIER, 0x18)
    FIELD(CIER, LSIRDYIE, 0, 1)
    FIELD(CIER, LSERDYIE, 1, 1)
    FIELD(CIER, HSIRDYIE, 3, 1)
    FIELD(CIER, HSERDYIE, 4, 1)
    FIELD(CIER, PLLRDYIE, 5, 1)
    FIELD(CIER, LSECSSIE, 9, 1)
    FIELD(CIER, HSI48RDYIE, 10, 1)
REG32(CIFR, 0x1c)
    FIELD(CIFR, LSIRDYF, 0, 1)
    FIELD(CIFR, LSERDYF, 1, 1)
    FIELD(CIFR, HSIRDYF, 3, 1)
    FIELD(CIFR, HSERDYF, 4, 1)
    FIELD(CIFR, PLLRDYF, 5, 1)
    FIELD(CIFR, CSSF, 8, 1)
    FIELD(CIFR, LSECSSF, 9, 1)
    FIELD(CIFR, HSI48RDYF, 10, 1)
REG32(CICR, 0x20)
REG32(AHB1RSTR, 0x28)
    FIELD(AHB1RSTR, FLASHRST, 8, 1)
REG32(AHB2RSTR, 0x2c)
    FIELD(AHB2RSTR, GPIOARST, 0, 1)
    FIELD(AHB2RSTR, GPIOBRST, 1, 1)
    FIELD(AHB2RSTR, GPIOCRST, 2, 1)
    FIELD(AHB2RSTR, GPIODRST, 3, 1)
    FIELD(AHB2RSTR, GPIOERST, 4, 1)
    FIELD(AHB2RSTR, GPIOFRST, 5, 1)
    FIELD(AHB2RSTR, GPIOGRST, 6, 1)
REG32(AHB3RSTR, 0x30)
REG32(APB1RSTR1, 0x38)
    FIELD(APB1RSTR1, USART2RST, 17, 1)
    FIELD(APB1RSTR1, UART4RST, 19, 1)
    FIELD(APB1RSTR1, PWRRST, 28, 1)
REG32(APB1RSTR2, 0x3c)
REG32(APB2RSTR, 0x40)
    FIELD(APB2RSTR, SYSCFGRST, 0, 1)
    FIELD(APB2RSTR, USART1RST, 14, 1)
REG32(AHB1ENR, 0x48)
    FIELD(AHB1ENR, DMA1EN, 0, 1)
    FIELD(AHB1ENR, FLASHEN, 8, 1)
REG32(AHB2ENR, 0x4c)
    FIELD(AHB2ENR, GPIOAEN, 0, 1)
    FIELD(AHB2ENR, GPIOBEN, 1, 1)
    FIELD(AHB2ENR, GPIOCEN, 2, 1)
    FIELD(AHB2ENR, GPIODEN, 3, 1)
    FIELD(AHB2ENR, GPIOEEN, 4, 1)
    FIELD(AHB2ENR, GPIOFEN, 5, 1)
    FIELD(AHB2ENR, GPIOGEN, 6, 1)
REG32(AHB3ENR, 0x50)
REG32(APB1ENR1, 0x58)
    FIELD(APB1ENR1, USART2EN, 17, 1)
    FIELD(APB1ENR1, UART4EN, 19, 1)
    FIELD(APB1ENR1, USBEN, 23, 1)
    FIELD(APB1ENR1, FDCANEN, 25, 1)
    FIELD(APB1ENR1, PWREN, 28, 1)
REG32(APB1ENR2, 0x5c)
REG32(APB2ENR, 0x60)
    FIELD(APB2ENR, SYSCFGEN, 0, 1)
    FIELD(APB2ENR, USART1EN, 14, 1)
REG32(AHB1SMENR, 0x68)
REG32(AHB2SMENR, 0x6c)
REG32(AHB3SMENR, 0x70)
REG32(APB1SMENR1, 0x78)
REG32(APB1SMENR2, 0x7c)
REG32(APB2SMENR, 0x80)
REG32(CCIPR, 0x88)
    FIELD(CCIPR, USART1SEL, 0, 2)
    FIELD(CCIPR, USART2SEL, 2, 2)
    FIELD(CCIPR, UART4SEL, 6, 2)
    FIELD(CCIPR, FDCANSEL, 24, 2)
    FIELD(CCIPR, CLK48SEL, 26, 2)
REG32(BDCR, 0x90)
    FIELD(BDCR, LSERDY, 1, 1)
    FIELD(BDCR, LSECSSD, 6, 1)
REG32(CSR, 0x94)
    FIELD(CSR, LSION, 0, 1)
    FIELD(CSR, LSIRDY, 1, 1)
    FIELD(CSR, RMVF, 23, 1)
REG32(CRRCR, 0x98)
    FIELD(CRRCR, HSI48ON, 0, 1)
    FIELD(CRRCR, HSI48RDY, 1, 1)
    FIELD(CRRCR, HSI48CAL, 7, 9)
REG32(CCIPR2, 0x9c)

#define RCC_CR_IMPLEMENTED         0x030f0700U
#define RCC_ICSCR_IMPLEMENTED      0x7fff0000U
#define RCC_CFGR_IMPLEMENTED       0x7f003fffU
#define RCC_PLLCFGR_IMPLEMENTED    0xff737ff3U
#define RCC_CIER_IMPLEMENTED       0x0000063bU
#define RCC_CIFR_IMPLEMENTED       0x0000073bU
#define RCC_CICR_IMPLEMENTED       0x0000073bU
#define RCC_AHB1RSTR_IMPLEMENTED   0x0000111fU
#define RCC_AHB2RSTR_IMPLEMENTED   0x040f607fU
#define RCC_AHB3RSTR_IMPLEMENTED   0x00000101U
#define RCC_APB1RSTR1_IMPLEMENTED  0xd2fec13fU
#define RCC_APB1RSTR2_IMPLEMENTED  0x00000103U
#define RCC_APB2RSTR_IMPLEMENTED   0x0437f801U
#define RCC_AHB1ENR_IMPLEMENTED    0x0000111fU
#define RCC_AHB2ENR_IMPLEMENTED    0x040f607fU
#define RCC_AHB3ENR_IMPLEMENTED    0x00000101U
#define RCC_APB1ENR1_IMPLEMENTED   0xd2fecd3fU
#define RCC_APB1ENR2_IMPLEMENTED   0x00000103U
#define RCC_APB2ENR_IMPLEMENTED    0x0437f801U
#define RCC_AHB1SMENR_IMPLEMENTED  0x0000131fU
#define RCC_AHB2SMENR_IMPLEMENTED  0x040f667fU
#define RCC_AHB3SMENR_IMPLEMENTED  0x00000101U
#define RCC_APB1SMENR1_IMPLEMENTED 0xd2fecd3fU
#define RCC_APB1SMENR2_IMPLEMENTED 0x00000103U
#define RCC_APB2SMENR_IMPLEMENTED  0x0437f801U
#define RCC_CCIPR_IMPLEMENTED      UINT32_MAX
#define RCC_BDCR_IMPLEMENTED       0x0301837fU
#define RCC_CSR_IMPLEMENTED        0xfe800003U
#define RCC_CRRCR_IMPLEMENTED      0x0000ff83U
#define RCC_CCIPR2_IMPLEMENTED     0x00300003U

#define RCC_CR_RO (R_CR_PLLRDY_MASK | R_CR_HSERDY_MASK | R_CR_HSIRDY_MASK)
#define RCC_CIER_READY_MASK 0x0000063bU
#define RCC_CSR_RESET_FLAGS 0xfe000000U
#define RCC_BDCR_RO (R_BDCR_LSERDY_MASK | R_BDCR_LSECSSD_MASK)
#define RCC_CRRCR_RO (R_CRRCR_HSI48RDY_MASK | R_CRRCR_HSI48CAL_MASK)

#define RCC_PLLCFGR_PROTECTED_MASK 0xfe627ff3U
/* DS12288 Rev 6, 5.3.9, Range 1 boost operating limits. */
#define RCC_PLL_MIN_INPUT_HZ 2660000ULL
#define RCC_PLL_MAX_INPUT_HZ 16000000ULL
#define RCC_PLL_MIN_VCO_HZ 96000000ULL
#define RCC_PLL_MAX_VCO_HZ 344000000ULL
#define RCC_PLL_MAX_OUTPUT_HZ 170000000ULL

/*
 * RM0440 7.4.3 reserves zero and uses the same non-zero encoding for SW
 * and SWS.  This differs from several other STM32 families.
 */
enum {
    RCC_SYSCLK_RESERVED,
    RCC_SYSCLK_HSI16,
    RCC_SYSCLK_HSE,
    RCC_SYSCLK_PLL,
};

#define RCC_AHB1RSTR_MODELED R_AHB1RSTR_FLASHRST_MASK
#define RCC_AHB2RSTR_MODELED \
    (R_AHB2RSTR_GPIOARST_MASK | R_AHB2RSTR_GPIOBRST_MASK | \
     R_AHB2RSTR_GPIOCRST_MASK | R_AHB2RSTR_GPIODRST_MASK | \
     R_AHB2RSTR_GPIOERST_MASK | R_AHB2RSTR_GPIOFRST_MASK | \
     R_AHB2RSTR_GPIOGRST_MASK)
#define RCC_APB1RSTR1_MODELED \
    (R_APB1RSTR1_USART2RST_MASK | R_APB1RSTR1_UART4RST_MASK | \
     R_APB1RSTR1_PWRRST_MASK)
#define RCC_APB2RSTR_MODELED \
    (R_APB2RSTR_SYSCFGRST_MASK | R_APB2RSTR_USART1RST_MASK)
#define RCC_AHB1ENR_MODELED \
    (R_AHB1ENR_DMA1EN_MASK | R_AHB1ENR_FLASHEN_MASK)
#define RCC_AHB2ENR_MODELED \
    (R_AHB2ENR_GPIOAEN_MASK | R_AHB2ENR_GPIOBEN_MASK | \
     R_AHB2ENR_GPIOCEN_MASK | R_AHB2ENR_GPIODEN_MASK | \
     R_AHB2ENR_GPIOEEN_MASK | R_AHB2ENR_GPIOFEN_MASK | \
     R_AHB2ENR_GPIOGEN_MASK)
#define RCC_APB1ENR1_MODELED \
    (R_APB1ENR1_USART2EN_MASK | R_APB1ENR1_UART4EN_MASK | \
     R_APB1ENR1_USBEN_MASK | R_APB1ENR1_FDCANEN_MASK | \
     R_APB1ENR1_PWREN_MASK)
#define RCC_APB2ENR_MODELED \
    (R_APB2ENR_SYSCFGEN_MASK | R_APB2ENR_USART1EN_MASK)
#define RCC_CCIPR_MODELED \
    (R_CCIPR_USART1SEL_MASK | R_CCIPR_USART2SEL_MASK | \
     R_CCIPR_UART4SEL_MASK | R_CCIPR_FDCANSEL_MASK | \
     R_CCIPR_CLK48SEL_MASK)

typedef struct Stm32g474PllRates {
    uint64_t p;
    uint64_t q;
    uint64_t r;
    bool ready;
} Stm32g474PllRates;

static void stm32g474_rcc_update_clocks(Stm32g474RccState *s,
                                         bool propagate);
static void stm32g474_rcc_reconcile_ready(Stm32g474RccState *s,
                                           bool generate_events);

static bool stm32g474_rcc_hsi16_ready(Stm32g474RccState *s)
{
    return (s->regs[R_CR] & R_CR_HSIRDY_MASK) != 0;
}

static bool stm32g474_rcc_hse_ready(Stm32g474RccState *s)
{
    return (s->regs[R_CR] & R_CR_HSERDY_MASK) != 0;
}

static uint64_t stm32g474_rcc_hsi16_hz(Stm32g474RccState *s)
{
    return stm32g474_rcc_hsi16_ready(s) ?
           clock_get_hz(s->hsi16_in) : 0;
}

