zevorn/qemu/hw/misc/stm32g474_rcc.c
static uint64_t stm32g474_rcc_hsi16_kernel_hz(Stm32g474RccState *s)
{
    uint32_t enabled = R_CR_HSION_MASK | R_CR_HSIKERON_MASK;

    return (s->regs[R_CR] & enabled) ? clock_get_hz(s->hsi16_in) : 0;
}

static uint64_t stm32g474_rcc_hse_hz(Stm32g474RccState *s)
{
    return stm32g474_rcc_hse_ready(s) ? clock_get_hz(s->hse_in) : 0;
}

static uint64_t stm32g474_rcc_pll_output(uint64_t vco, uint32_t divisor)
{
    uint64_t rate;

    if (!divisor) {
        return 0;
    }

    rate = vco / divisor;
    return rate <= RCC_PLL_MAX_OUTPUT_HZ ? rate : 0;
}

static Stm32g474PllRates
stm32g474_rcc_calculate_pll(Stm32g474RccState *s)
{
    Stm32g474PllRates rates = { 0 };
    uint32_t pllcfgr = s->regs[R_PLLCFGR];
    uint32_t source_sel = FIELD_EX32(pllcfgr, PLLCFGR, PLLSRC);
    uint32_t m = FIELD_EX32(pllcfgr, PLLCFGR, PLLM) + 1;
    uint32_t n = FIELD_EX32(pllcfgr, PLLCFGR, PLLN);
    uint32_t pdiv = FIELD_EX32(pllcfgr, PLLCFGR, PLLPDIV);
    uint32_t p;
    uint64_t source;
    uint64_t vco;
    uint64_t vco_numerator;

    if (source_sel == 2) {
        source = stm32g474_rcc_hsi16_hz(s);
    } else if (source_sel == 3) {
        source = stm32g474_rcc_hse_hz(s);
    } else {
        source = 0;
    }

    if (!source || n < 8 || n > 127 ||
        source < RCC_PLL_MIN_INPUT_HZ * m ||
        source > RCC_PLL_MAX_INPUT_HZ * m) {
        return rates;
    }

    vco_numerator = source * n;
    if (vco_numerator < RCC_PLL_MIN_VCO_HZ * m ||
        vco_numerator > RCC_PLL_MAX_VCO_HZ * m) {
        return rates;
    }
    vco = vco_numerator / m;

    if (pdiv == 0) {
        p = FIELD_EX32(pllcfgr, PLLCFGR, PLLP) ? 17 : 7;
    } else if (pdiv == 1) {
        p = 0;
    } else {
        p = pdiv;
    }

    if (pllcfgr & R_PLLCFGR_PLLPEN_MASK) {
        rates.p = stm32g474_rcc_pll_output(vco, p);
    }
    if (pllcfgr & R_PLLCFGR_PLLQEN_MASK) {
        rates.q = stm32g474_rcc_pll_output(
            vco, 2 * (FIELD_EX32(pllcfgr, PLLCFGR, PLLQ) + 1));
    }
    if (pllcfgr & R_PLLCFGR_PLLREN_MASK) {
        rates.r = stm32g474_rcc_pll_output(
            vco, 2 * (FIELD_EX32(pllcfgr, PLLCFGR, PLLR) + 1));
    }

    if (((pllcfgr & R_PLLCFGR_PLLPEN_MASK) && !rates.p) ||
        ((pllcfgr & R_PLLCFGR_PLLQEN_MASK) && !rates.q) ||
        ((pllcfgr & R_PLLCFGR_PLLREN_MASK) && !rates.r)) {
        rates.p = 0;
        rates.q = 0;
        rates.r = 0;
        return rates;
    }

    rates.ready = true;
    return rates;
}

static uint32_t stm32g474_rcc_hpre_divisor(uint32_t encoding)
{
    static const uint16_t divisors[] = {
        2, 4, 8, 16, 64, 128, 256, 512,
    };

    return encoding < 8 ? 1 : divisors[encoding - 8];
}

static uint32_t stm32g474_rcc_ppre_divisor(uint32_t encoding)
{
    return encoding < 4 ? 1 : 1U << (encoding - 3);
}

static void stm32g474_rcc_set_clock(Clock *clock, uint64_t hz,
                                    bool propagate)
{
    g_assert(hz <= UINT_MAX);

    if (propagate) {
        clock_update_hz(clock, hz);
    } else {
        clock_set_hz(clock, hz);
    }
}

static uint64_t stm32g474_rcc_uart_hz(Stm32g474RccState *s,
                                      uint32_t selection,
                                      uint64_t pclk, uint64_t sysclk)
{
    switch (selection) {
    case 0:
        return pclk;
    case 1:
        return sysclk;
    case 2:
        return stm32g474_rcc_hsi16_kernel_hz(s);
    default:
        return 0;
    }
}

static uint64_t stm32g474_rcc_clk48_hz(Stm32g474RccState *s,
                                       uint32_t selection,
                                       const Stm32g474PllRates *pll)
{
    switch (selection) {
    case 0:
        return (s->regs[R_CRRCR] & R_CRRCR_HSI48RDY_MASK) ?
               clock_get_hz(s->hsi48_in) : 0;
    case 2:
        return pll->q;
    default:
        return 0;
    }
}

static uint64_t stm32g474_rcc_fdcan_hz(Stm32g474RccState *s,
                                       uint32_t selection, uint64_t pclk1,
                                       const Stm32g474PllRates *pll)
{
    switch (selection) {
    case 0:
        return stm32g474_rcc_hse_hz(s);
    case 1:
        return pll->q;
    case 2:
        return pclk1;
    default:
        return 0;
    }
}

static void stm32g474_rcc_update_clocks(Stm32g474RccState *s,
                                         bool propagate)
{
    Stm32g474PllRates pll = stm32g474_rcc_calculate_pll(s);
    uint32_t cfgr = s->regs[R_CFGR];
    uint32_t ccipr = s->regs[R_CCIPR];
    uint32_t sws = FIELD_EX32(cfgr, CFGR, SWS);
    uint64_t sysclk;
    uint64_t hclk;
    uint64_t pclk1;
    uint64_t pclk2;
    uint64_t gates[STM32G474_RCC_GATE_COUNT] = { 0 };

    if (!(s->regs[R_CR] & R_CR_PLLRDY_MASK)) {
        pll.p = 0;
        pll.q = 0;
        pll.r = 0;
    }

    switch (sws) {
    case RCC_SYSCLK_HSI16:
        sysclk = stm32g474_rcc_hsi16_hz(s);
        break;
    case RCC_SYSCLK_HSE:
        sysclk = stm32g474_rcc_hse_hz(s);
        break;
    case RCC_SYSCLK_PLL:
        sysclk = pll.r;
        break;
    default:
        sysclk = 0;
        break;
    }

    hclk = sysclk /
        stm32g474_rcc_hpre_divisor(FIELD_EX32(cfgr, CFGR, HPRE));
    pclk1 = hclk /
        stm32g474_rcc_ppre_divisor(FIELD_EX32(cfgr, CFGR, PPRE1));
    pclk2 = hclk /
        stm32g474_rcc_ppre_divisor(FIELD_EX32(cfgr, CFGR, PPRE2));

    if (s->regs[R_AHB1ENR] & R_AHB1ENR_DMA1EN_MASK) {
        gates[STM32G474_RCC_GATE_DMA1] = hclk;
    }
    if (s->regs[R_AHB1ENR] & R_AHB1ENR_FLASHEN_MASK) {
        gates[STM32G474_RCC_GATE_FLASH] = hclk;
    }
    for (unsigned int i = 0; i < 7; i++) {
        if (s->regs[R_AHB2ENR] & (1U << i)) {
            gates[STM32G474_RCC_GATE_GPIOA + i] = hclk;
        }
    }
    if (s->regs[R_APB1ENR1] & R_APB1ENR1_PWREN_MASK) {
        gates[STM32G474_RCC_GATE_PWR] = pclk1;
    }
    if (s->regs[R_APB1ENR1] & R_APB1ENR1_USBEN_MASK) {
        gates[STM32G474_RCC_GATE_USB] = stm32g474_rcc_clk48_hz(
            s, FIELD_EX32(ccipr, CCIPR, CLK48SEL), &pll);
    }
    if (s->regs[R_APB1ENR1] & R_APB1ENR1_FDCANEN_MASK) {
        gates[STM32G474_RCC_GATE_FDCAN] = stm32g474_rcc_fdcan_hz(
            s, FIELD_EX32(ccipr, CCIPR, FDCANSEL), pclk1, &pll);
    }
    if (s->regs[R_APB2ENR] & R_APB2ENR_USART1EN_MASK) {
        gates[STM32G474_RCC_GATE_USART1] = stm32g474_rcc_uart_hz(
            s, FIELD_EX32(ccipr, CCIPR, USART1SEL), pclk2, sysclk);
    }
    if (s->regs[R_APB2ENR] & R_APB2ENR_SYSCFGEN_MASK) {
        gates[STM32G474_RCC_GATE_SYSCFG] = pclk2;
    }
    if (s->regs[R_APB1ENR1] & R_APB1ENR1_USART2EN_MASK) {
        gates[STM32G474_RCC_GATE_USART2] = stm32g474_rcc_uart_hz(
            s, FIELD_EX32(ccipr, CCIPR, USART2SEL), pclk1, sysclk);
    }
    if (s->regs[R_APB1ENR1] & R_APB1ENR1_UART4EN_MASK) {
        gates[STM32G474_RCC_GATE_UART4] = stm32g474_rcc_uart_hz(
            s, FIELD_EX32(ccipr, CCIPR, UART4SEL), pclk1, sysclk);
    }

    stm32g474_rcc_set_clock(s->sysclk, sysclk, propagate);
    stm32g474_rcc_set_clock(s->hclk, hclk, propagate);
    stm32g474_rcc_set_clock(s->pclk1, pclk1, propagate);
    stm32g474_rcc_set_clock(s->pclk2, pclk2, propagate);
    stm32g474_rcc_set_clock(s->cortex_refclk, hclk / 8, propagate);
    stm32g474_rcc_set_clock(s->pll_p, pll.p, propagate);
    stm32g474_rcc_set_clock(s->pll_q, pll.q, propagate);
    stm32g474_rcc_set_clock(s->pll_r, pll.r, propagate);
    for (unsigned int i = 0; i < STM32G474_RCC_GATE_COUNT; i++) {
        stm32g474_rcc_set_clock(s->gate[i], gates[i], propagate);
    }
}

