zevorn/qemu/hw/misc/stm32g474_rcc.c
static bool stm32g474_rcc_sws_ready(Stm32g474RccState *s, uint32_t sws)
{
    Stm32g474PllRates pll;

    switch (sws) {
    case RCC_SYSCLK_HSI16:
        return stm32g474_rcc_hsi16_ready(s);
    case RCC_SYSCLK_HSE:
        return stm32g474_rcc_hse_ready(s);
    case RCC_SYSCLK_PLL:
        pll = stm32g474_rcc_calculate_pll(s);
        return (s->regs[R_CR] & R_CR_PLLRDY_MASK) && pll.r;
    default:
        return false;
    }
}

static void stm32g474_rcc_retry_switch(Stm32g474RccState *s)
{
    uint32_t requested = FIELD_EX32(s->regs[R_CFGR], CFGR, SW);
    uint32_t current = FIELD_EX32(s->regs[R_CFGR], CFGR, SWS);

    if (!stm32g474_rcc_sws_ready(s, current) &&
        stm32g474_rcc_hsi16_ready(s)) {
        current = RCC_SYSCLK_HSI16;
    }
    if (requested != RCC_SYSCLK_RESERVED &&
        stm32g474_rcc_sws_ready(s, requested)) {
        current = requested;
    }
    s->regs[R_CFGR] = FIELD_DP32(s->regs[R_CFGR], CFGR, SWS, current);
}

static void stm32g474_rcc_set_ready(Stm32g474RccState *s,
                                    unsigned int reg_index,
                                    uint32_t ready_mask,
                                    uint32_t interrupt_mask, bool ready,
                                    bool generate_events)
{
    bool was_ready = (s->regs[reg_index] & ready_mask) != 0;

    if (ready) {
        s->regs[reg_index] |= ready_mask;
    } else {
        s->regs[reg_index] &= ~ready_mask;
    }

    if (generate_events && !was_ready && ready &&
        (s->regs[R_CIER] & interrupt_mask)) {
        s->regs[R_CIFR] |= interrupt_mask;
    }
}

static void stm32g474_rcc_reconcile_ready(Stm32g474RccState *s,
                                           bool generate_events)
{
    Stm32g474PllRates pll;
    bool hsi16;
    bool hse;
    bool lsi;
    bool hsi48;

    hsi16 = (s->regs[R_CR] & R_CR_HSION_MASK) &&
            clock_has_source(s->hsi16_in) &&
            clock_get_hz(s->hsi16_in);
    hse = (s->regs[R_CR] & R_CR_HSEON_MASK) &&
          clock_has_source(s->hse_in) && clock_get_hz(s->hse_in);

    stm32g474_rcc_set_ready(s, R_CR, R_CR_HSIRDY_MASK,
                            R_CIFR_HSIRDYF_MASK, hsi16, generate_events);
    stm32g474_rcc_set_ready(s, R_CR, R_CR_HSERDY_MASK,
                            R_CIFR_HSERDYF_MASK, hse, generate_events);

    pll = stm32g474_rcc_calculate_pll(s);
    stm32g474_rcc_set_ready(s, R_CR, R_CR_PLLRDY_MASK,
                            R_CIFR_PLLRDYF_MASK,
                            (s->regs[R_CR] & R_CR_PLLON_MASK) && pll.ready,
                            generate_events);

    lsi = (s->regs[R_CSR] & R_CSR_LSION_MASK) &&
          clock_has_source(s->lsi_in) && clock_get_hz(s->lsi_in);
    hsi48 = (s->regs[R_CRRCR] & R_CRRCR_HSI48ON_MASK) &&
            clock_has_source(s->hsi48_in) &&
            clock_get_hz(s->hsi48_in);
    stm32g474_rcc_set_ready(s, R_CSR, R_CSR_LSIRDY_MASK,
                            R_CIFR_LSIRDYF_MASK, lsi, generate_events);
    stm32g474_rcc_set_ready(s, R_CRRCR, R_CRRCR_HSI48RDY_MASK,
                            R_CIFR_HSI48RDYF_MASK, hsi48,
                            generate_events);
    stm32g474_rcc_retry_switch(s);
}

static void stm32g474_rcc_update_irq(Stm32g474RccState *s)
{
    bool level;

    if (s->resetting) {
        return;
    }
    level = (s->regs[R_CIER] & s->regs[R_CIFR] &
             RCC_CIER_READY_MASK) != 0;
    qemu_set_irq(s->irq, level);
}

static void stm32g474_rcc_update_resets(Stm32g474RccState *s)
{
    if (s->resetting) {
        return;
    }

    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_USART1],
                 (s->regs[R_APB2RSTR] & R_APB2RSTR_USART1RST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_USART2],
                 (s->regs[R_APB1RSTR1] &
                  R_APB1RSTR1_USART2RST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_UART4],
                 (s->regs[R_APB1RSTR1] &
                  R_APB1RSTR1_UART4RST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_PWR],
                 (s->regs[R_APB1RSTR1] &
                  R_APB1RSTR1_PWRRST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_FLASH],
                 (s->regs[R_AHB1RSTR] &
                  R_AHB1RSTR_FLASHRST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_GPIOA],
                 (s->regs[R_AHB2RSTR] &
                  R_AHB2RSTR_GPIOARST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_GPIOB],
                 (s->regs[R_AHB2RSTR] &
                  R_AHB2RSTR_GPIOBRST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_GPIOC],
                 (s->regs[R_AHB2RSTR] &
                  R_AHB2RSTR_GPIOCRST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_GPIOD],
                 (s->regs[R_AHB2RSTR] &
                  R_AHB2RSTR_GPIODRST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_GPIOE],
                 (s->regs[R_AHB2RSTR] &
                  R_AHB2RSTR_GPIOERST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_GPIOF],
                 (s->regs[R_AHB2RSTR] &
                  R_AHB2RSTR_GPIOFRST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_GPIOG],
                 (s->regs[R_AHB2RSTR] &
                  R_AHB2RSTR_GPIOGRST_MASK) != 0);
    qemu_set_irq(s->peripheral_reset[STM32G474_RCC_RESET_SYSCFG],
                 (s->regs[R_APB2RSTR] &
                  R_APB2RSTR_SYSCFGRST_MASK) != 0);
}

static void stm32g474_rcc_register_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474RccState *s = STM32G474_RCC(reg->opaque);

    if (s->resetting) {
        return;
    }
    stm32g474_rcc_reconcile_ready(s, true);
    stm32g474_rcc_update_clocks(s, true);
    stm32g474_rcc_update_irq(s);
}

static uint64_t stm32g474_rcc_cr_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474RccState *s = STM32G474_RCC(reg->opaque);
    uint32_t old = s->regs[R_CR];
    uint32_t sws = FIELD_EX32(s->regs[R_CFGR], CFGR, SWS);
    uint32_t pll_source = FIELD_EX32(s->regs[R_PLLCFGR],
                                     PLLCFGR, PLLSRC);

