zevorn/qemu/hw/misc/stm32g474_rcc.c
    val |= old & R_CR_CSSON_MASK;
    if ((old & R_CR_HSEON_MASK) &&
        ((old ^ val) & R_CR_HSEBYP_MASK)) {
        val = (val & ~R_CR_HSEBYP_MASK) | (old & R_CR_HSEBYP_MASK);
    }
    if (!(val & R_CR_HSION_MASK) &&
        (sws == RCC_SYSCLK_HSI16 ||
         (sws == RCC_SYSCLK_PLL && pll_source == 2))) {
        val |= R_CR_HSION_MASK;
    }
    if (!(val & R_CR_HSEON_MASK) &&
        (sws == RCC_SYSCLK_HSE ||
         (sws == RCC_SYSCLK_PLL && pll_source == 3))) {
        val |= R_CR_HSEON_MASK;
    }
    if (!(val & R_CR_PLLON_MASK) && sws == RCC_SYSCLK_PLL) {
        val |= R_CR_PLLON_MASK;
    }

    return val;
}

static void stm32g474_rcc_update_hsi_calibration(Stm32g474RccState *s)
{
    uint32_t trim = FIELD_EX32(s->regs[R_ICSCR], ICSCR, HSITRIM);

    s->regs[R_ICSCR] = FIELD_DP32(s->regs[R_ICSCR], ICSCR, HSICAL, trim);
}

static void stm32g474_rcc_icscr_post_write(RegisterInfo *reg, uint64_t val)
{
    stm32g474_rcc_update_hsi_calibration(STM32G474_RCC(reg->opaque));
}

static uint64_t stm32g474_rcc_cfgr_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474RccState *s = STM32G474_RCC(reg->opaque);

    if (FIELD_EX32(val, CFGR, SW) == RCC_SYSCLK_RESERVED) {
        val = FIELD_DP32(val, CFGR, SW,
                         FIELD_EX32(s->regs[R_CFGR], CFGR, SW));
    }
    return val;
}

static uint64_t
stm32g474_rcc_pllcfgr_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474RccState *s = STM32G474_RCC(reg->opaque);
    uint32_t old = s->regs[R_PLLCFGR];

    if (s->regs[R_CR] & R_CR_PLLON_MASK) {
        val = (val & ~RCC_PLLCFGR_PROTECTED_MASK) |
              (old & RCC_PLLCFGR_PROTECTED_MASK);
    }
    if (FIELD_EX32(s->regs[R_CFGR], CFGR, SWS) == RCC_SYSCLK_PLL) {
        val = (val & ~R_PLLCFGR_PLLREN_MASK) |
              (old & R_PLLCFGR_PLLREN_MASK);
    }
    return val;
}

static void stm32g474_rcc_cier_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474RccState *s = STM32G474_RCC(reg->opaque);

    stm32g474_rcc_update_irq(s);
}

static uint64_t stm32g474_rcc_cicr_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474RccState *s = STM32G474_RCC(reg->opaque);

    s->regs[R_CIFR] &= ~(val & RCC_CICR_IMPLEMENTED);
    stm32g474_rcc_update_irq(s);
    return 0;
}

static void stm32g474_rcc_gate_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474RccState *s = STM32G474_RCC(reg->opaque);

    if (!s->resetting) {
        stm32g474_rcc_update_clocks(s, true);
    }
}

static void stm32g474_rcc_reset_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474RccState *s = STM32G474_RCC(reg->opaque);

    stm32g474_rcc_update_resets(s);
}

static uint64_t stm32g474_rcc_csr_pre_write(RegisterInfo *reg, uint64_t val)
{
    if (val & R_CSR_RMVF_MASK) {
        val &= ~(R_CSR_RMVF_MASK | RCC_CSR_RESET_FLAGS);
    }
    return val;
}

static void stm32g474_rcc_input_clock_update(void *opaque, ClockEvent event)
{
    Stm32g474RccState *s = STM32G474_RCC(opaque);

    if (s->resetting) {
        return;
    }
    stm32g474_rcc_reconcile_ready(s, true);
    stm32g474_rcc_update_clocks(s, true);
    stm32g474_rcc_update_irq(s);
}

#define RCC_REG(_name, _reset, _implemented) \
    { .name = #_name, .addr = A_##_name, .reset = (_reset), \
      .rsvd = UINT32_MAX & ~(_implemented), .unimp = (_implemented) }

static const RegisterAccessInfo stm32g474_rcc_regs_info[] = {
    {
        .name = "CR",
        .addr = A_CR,
        .reset = 0x00000500,
        .rsvd = UINT32_MAX & ~RCC_CR_IMPLEMENTED,
        .ro = RCC_CR_RO,
        .unimp = R_CR_CSSON_MASK,
        .pre_write = stm32g474_rcc_cr_pre_write,
        .post_write = stm32g474_rcc_register_post_write,
    }, {
        .name = "ICSCR",
        .addr = A_ICSCR,
        .reset = 0x40400000,
        .rsvd = UINT32_MAX & ~RCC_ICSCR_IMPLEMENTED,
        .ro = R_ICSCR_HSICAL_MASK,
        .post_write = stm32g474_rcc_icscr_post_write,
    }, {
        .name = "CFGR",
        .addr = A_CFGR,
        .reset = 0x00000005,
        .rsvd = UINT32_MAX & ~RCC_CFGR_IMPLEMENTED,
        .ro = R_CFGR_SWS_MASK,
        .unimp = R_CFGR_MCOSEL_MASK | R_CFGR_MCOPRE_MASK,
        .pre_write = stm32g474_rcc_cfgr_pre_write,
        .post_write = stm32g474_rcc_register_post_write,
    }, {
        .name = "PLLCFGR",
        .addr = A_PLLCFGR,
        .reset = 0x00001000,
        .rsvd = UINT32_MAX & ~RCC_PLLCFGR_IMPLEMENTED,
        .pre_write = stm32g474_rcc_pllcfgr_pre_write,
        .post_write = stm32g474_rcc_register_post_write,
    }, {
        .name = "CIER",
        .addr = A_CIER,
        .rsvd = UINT32_MAX & ~RCC_CIER_IMPLEMENTED,
        .unimp = R_CIER_LSERDYIE_MASK | R_CIER_LSECSSIE_MASK,
        .post_write = stm32g474_rcc_cier_post_write,
    }, {
        .name = "CIFR",
        .addr = A_CIFR,
        .rsvd = UINT32_MAX & ~RCC_CIFR_IMPLEMENTED,
        .ro = RCC_CIFR_IMPLEMENTED,
    }, {
        .name = "CICR",
        .addr = A_CICR,
        .rsvd = UINT32_MAX & ~RCC_CICR_IMPLEMENTED,
        .pre_write = stm32g474_rcc_cicr_pre_write,
    }, {
        .name = "AHB1RSTR",
        .addr = A_AHB1RSTR,
        .rsvd = UINT32_MAX & ~RCC_AHB1RSTR_IMPLEMENTED,
        .unimp = RCC_AHB1RSTR_IMPLEMENTED & ~RCC_AHB1RSTR_MODELED,
        .post_write = stm32g474_rcc_reset_post_write,
    }, {
        .name = "AHB2RSTR",
        .addr = A_AHB2RSTR,
        .rsvd = UINT32_MAX & ~RCC_AHB2RSTR_IMPLEMENTED,
        .unimp = RCC_AHB2RSTR_IMPLEMENTED & ~RCC_AHB2RSTR_MODELED,
        .post_write = stm32g474_rcc_reset_post_write,
    }, {
        .name = "AHB3RSTR",
        .addr = A_AHB3RSTR,
        .rsvd = UINT32_MAX & ~RCC_AHB3RSTR_IMPLEMENTED,
        .unimp = RCC_AHB3RSTR_IMPLEMENTED,
    }, {
        .name = "APB1RSTR1",
        .addr = A_APB1RSTR1,
        .rsvd = UINT32_MAX & ~RCC_APB1RSTR1_IMPLEMENTED,
        .unimp = RCC_APB1RSTR1_IMPLEMENTED & ~RCC_APB1RSTR1_MODELED,
        .post_write = stm32g474_rcc_reset_post_write,
    }, {
        .name = "APB1RSTR2",
        .addr = A_APB1RSTR2,
        .rsvd = UINT32_MAX & ~RCC_APB1RSTR2_IMPLEMENTED,
        .unimp = RCC_APB1RSTR2_IMPLEMENTED,
    }, {
        .name = "APB2RSTR",
        .addr = A_APB2RSTR,
        .rsvd = UINT32_MAX & ~RCC_APB2RSTR_IMPLEMENTED,
        .unimp = RCC_APB2RSTR_IMPLEMENTED & ~RCC_APB2RSTR_MODELED,
        .post_write = stm32g474_rcc_reset_post_write,
    }, {
        .name = "AHB1ENR",
        .addr = A_AHB1ENR,
        .reset = 0x00000100,
        .rsvd = UINT32_MAX & ~RCC_AHB1ENR_IMPLEMENTED,
        .unimp = RCC_AHB1ENR_IMPLEMENTED & ~RCC_AHB1ENR_MODELED,
        .post_write = stm32g474_rcc_gate_post_write,
    }, {
        .name = "AHB2ENR",
        .addr = A_AHB2ENR,
        .rsvd = UINT32_MAX & ~RCC_AHB2ENR_IMPLEMENTED,
        .unimp = RCC_AHB2ENR_IMPLEMENTED & ~RCC_AHB2ENR_MODELED,
        .post_write = stm32g474_rcc_gate_post_write,
    }, {
        .name = "AHB3ENR",
        .addr = A_AHB3ENR,
        .rsvd = UINT32_MAX & ~RCC_AHB3ENR_IMPLEMENTED,
        .unimp = RCC_AHB3ENR_IMPLEMENTED,
    }, {
        .name = "APB1ENR1",
        .addr = A_APB1ENR1,
        .reset = 0x00000400,
        .rsvd = UINT32_MAX & ~RCC_APB1ENR1_IMPLEMENTED,
        .unimp = RCC_APB1ENR1_IMPLEMENTED & ~RCC_APB1ENR1_MODELED,
        .post_write = stm32g474_rcc_gate_post_write,
    }, {
        .name = "APB1ENR2",
        .addr = A_APB1ENR2,
        .rsvd = UINT32_MAX & ~RCC_APB1ENR2_IMPLEMENTED,
        .unimp = RCC_APB1ENR2_IMPLEMENTED,
    }, {
        .name = "APB2ENR",
        .addr = A_APB2ENR,
        .rsvd = UINT32_MAX & ~RCC_APB2ENR_IMPLEMENTED,
        .unimp = RCC_APB2ENR_IMPLEMENTED & ~RCC_APB2ENR_MODELED,
        .post_write = stm32g474_rcc_gate_post_write,
    },
    RCC_REG(AHB1SMENR, 0x0000131f, RCC_AHB1SMENR_IMPLEMENTED),
    RCC_REG(AHB2SMENR, 0x040f667f, RCC_AHB2SMENR_IMPLEMENTED),
    RCC_REG(AHB3SMENR, 0x00000101, RCC_AHB3SMENR_IMPLEMENTED),
    RCC_REG(APB1SMENR1, 0xd2fecd3f, RCC_APB1SMENR1_IMPLEMENTED),
    RCC_REG(APB1SMENR2, 0x00000103, RCC_APB1SMENR2_IMPLEMENTED),
    RCC_REG(APB2SMENR, 0x0437f801, RCC_APB2SMENR_IMPLEMENTED),
    {
        .name = "CCIPR",
        .addr = A_CCIPR,
        .rsvd = UINT32_MAX & ~RCC_CCIPR_IMPLEMENTED,
        .unimp = RCC_CCIPR_IMPLEMENTED & ~RCC_CCIPR_MODELED,
        .post_write = stm32g474_rcc_gate_post_write,
    }, {
        .name = "BDCR",
        .addr = A_BDCR,
        .rsvd = UINT32_MAX & ~RCC_BDCR_IMPLEMENTED,
        .ro = RCC_BDCR_RO,
        .unimp = RCC_BDCR_IMPLEMENTED & ~RCC_BDCR_RO,
    }, {
        .name = "CSR",
        .addr = A_CSR,
        .reset = 0x0c000000,
        .rsvd = UINT32_MAX & ~RCC_CSR_IMPLEMENTED,
        .ro = R_CSR_LSIRDY_MASK | RCC_CSR_RESET_FLAGS,
        .pre_write = stm32g474_rcc_csr_pre_write,
        .post_write = stm32g474_rcc_register_post_write,
    }, {
        .name = "CRRCR",
        .addr = A_CRRCR,
        .rsvd = UINT32_MAX & ~RCC_CRRCR_IMPLEMENTED,
        .ro = RCC_CRRCR_RO,
        .post_write = stm32g474_rcc_register_post_write,
    }, {
        .name = "CCIPR2",
        .addr = A_CCIPR2,
        .rsvd = UINT32_MAX & ~RCC_CCIPR2_IMPLEMENTED,
        .unimp = RCC_CCIPR2_IMPLEMENTED,
    },
};

#undef RCC_REG

