zevorn/qemu/hw/misc/stm32g474_rcc.c
static RegisterInfo *
stm32g474_rcc_find_register(RegisterInfoArray *reg_array, hwaddr addr)
{
    for (int i = 0; i < reg_array->num_elements; i++) {
        if (reg_array->r[i]->access->addr == addr) {
            return reg_array->r[i];
        }
    }
    return NULL;
}

static uint64_t stm32g474_rcc_read(void *opaque, hwaddr addr, unsigned size)
{
    RegisterInfoArray *reg_array = opaque;
    hwaddr aligned = addr & ~0x3;
    unsigned int shift = (addr & 0x3) * 8;
    RegisterInfo *reg;
    uint64_t mask;

    if ((addr & 0x3) + size > 4) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: register read crosses a word boundary at 0x%"
                      HWADDR_PRIx "\n", reg_array->prefix, addr);
        return 0;
    }

    reg = stm32g474_rcc_find_register(reg_array, aligned);
    if (!reg) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: read from unimplemented register at 0x%"
                      HWADDR_PRIx "\n", reg_array->prefix, addr);
        return 0;
    }

    mask = MAKE_64BIT_MASK(shift, size * 8);
    return register_read(reg, mask, reg_array->prefix,
                         reg_array->debug) >> shift;
}

static void stm32g474_rcc_write(void *opaque, hwaddr addr, uint64_t value,
                                unsigned size)
{
    RegisterInfoArray *reg_array = opaque;
    hwaddr aligned = addr & ~0x3;
    unsigned int shift = (addr & 0x3) * 8;
    RegisterInfo *reg;
    uint64_t mask;

    if ((addr & 0x3) + size > 4) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: register write crosses a word boundary at 0x%"
                      HWADDR_PRIx "\n", reg_array->prefix, addr);
        return;
    }

    reg = stm32g474_rcc_find_register(reg_array, aligned);
    if (!reg) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: write to unimplemented register at 0x%"
                      HWADDR_PRIx "\n", reg_array->prefix, addr);
        return;
    }

    mask = MAKE_64BIT_MASK(shift, size * 8);
    register_write(reg, value << shift, mask, reg_array->prefix,
                   reg_array->debug);
}

static const MemoryRegionOps stm32g474_rcc_ops = {
    .read = stm32g474_rcc_read,
    .write = stm32g474_rcc_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
        .unaligned = false,
    },
    .impl = {
        .min_access_size = 1,
        .max_access_size = 4,
        .unaligned = false,
    },
};

static void stm32g474_rcc_zero_outputs(Stm32g474RccState *s)
{
    Clock *core[] = {
        s->sysclk, s->hclk, s->pclk1, s->pclk2, s->cortex_refclk,
        s->pll_p, s->pll_q, s->pll_r,
    };

    for (unsigned int i = 0; i < ARRAY_SIZE(core); i++) {
        clock_update_hz(core[i], 0);
    }
    for (unsigned int i = 0; i < STM32G474_RCC_GATE_COUNT; i++) {
        clock_update_hz(s->gate[i], 0);
    }
}

static void stm32g474_rcc_reset_enter(Object *obj, ResetType type)
{
    Stm32g474RccState *s = STM32G474_RCC(obj);
    uint32_t hsebyp = s->regs[R_CR] & R_CR_HSEBYP_MASK;

    s->resetting = true;
    for (unsigned int i = 0; i < ARRAY_SIZE(s->regs_info); i++) {
        register_reset(&s->regs_info[i]);
    }
    s->regs[R_CR] |= hsebyp;
}

static void stm32g474_rcc_reset_hold(Object *obj, ResetType type)
{
    Stm32g474RccState *s = STM32G474_RCC(obj);

    qemu_set_irq(s->irq, 0);
    stm32g474_rcc_zero_outputs(s);
    for (unsigned int i = 0; i < STM32G474_RCC_RESET_COUNT; i++) {
        qemu_set_irq(s->peripheral_reset[i], 0);
    }
}

static void stm32g474_rcc_reset_exit(Object *obj, ResetType type)
{
    Stm32g474RccState *s = STM32G474_RCC(obj);

    stm32g474_rcc_reconcile_ready(s, false);
    s->regs[R_CIFR] = 0;
    s->regs[R_CICR] = 0;
    s->resetting = false;
    stm32g474_rcc_update_clocks(s, true);
    stm32g474_rcc_update_resets(s);
    stm32g474_rcc_update_irq(s);
}

static int stm32g474_rcc_post_load(void *opaque, int version_id)
{
    Stm32g474RccState *s = STM32G474_RCC(opaque);

    for (unsigned int i = 0; i < ARRAY_SIZE(stm32g474_rcc_regs_info); i++) {
        const RegisterAccessInfo *access = &stm32g474_rcc_regs_info[i];
        unsigned int index = access->addr / 4;

        s->regs[index] = (s->regs[index] & ~access->rsvd) |
                         (access->reset & access->rsvd);
    }
    s->regs[R_CICR] = 0;
    s->regs[R_CSR] &= ~R_CSR_RMVF_MASK;
    s->regs[R_BDCR] &= ~RCC_BDCR_RO;
    s->regs[R_CRRCR] &= ~R_CRRCR_HSI48CAL_MASK;
    stm32g474_rcc_update_hsi_calibration(s);
    if (FIELD_EX32(s->regs[R_CFGR], CFGR, SW) ==
        RCC_SYSCLK_RESERVED) {
        s->regs[R_CFGR] = FIELD_DP32(s->regs[R_CFGR], CFGR, SW,
                                     RCC_SYSCLK_HSI16);
    }
    if (FIELD_EX32(s->regs[R_CFGR], CFGR, SWS) ==
        RCC_SYSCLK_RESERVED) {
        s->regs[R_CFGR] = FIELD_DP32(s->regs[R_CFGR], CFGR, SWS,
                                     RCC_SYSCLK_HSI16);
    }

    stm32g474_rcc_reconcile_ready(s, false);
    stm32g474_rcc_update_clocks(s, false);
    stm32g474_rcc_update_resets(s);
    stm32g474_rcc_update_irq(s);
    return 0;
}

static const VMStateDescription vmstate_stm32g474_rcc = {
    .name = TYPE_STM32G474_RCC,
    .version_id = 1,
    .minimum_version_id = 1,
    .post_load = stm32g474_rcc_post_load,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, Stm32g474RccState,
                             STM32G474_RCC_R_MAX),
        VMSTATE_END_OF_LIST()
    },
};

static void stm32g474_rcc_realize(DeviceState *dev, Error **errp)
{
    Stm32g474RccState *s = STM32G474_RCC(dev);

    if (!clock_has_source(s->hsi16_in)) {
        error_setg(errp, TYPE_STM32G474_RCC
                   ": hsi16-in clock must be connected");
        return;
    }
    if (!clock_has_source(s->hsi48_in)) {
        error_setg(errp, TYPE_STM32G474_RCC
                   ": hsi48-in clock must be connected");
        return;
    }
    if (!clock_has_source(s->lsi_in)) {
        error_setg(errp, TYPE_STM32G474_RCC
                   ": lsi-in clock must be connected");
    }
}

