zevorn/qemu/hw/misc/stm32g474_rcc.c
static void stm32g474_rcc_init(Object *obj)
{
    static const char *const gate_names[] = {
        [STM32G474_RCC_GATE_DMA1] = "dma1",
        [STM32G474_RCC_GATE_FLASH] = "flash",
        [STM32G474_RCC_GATE_GPIOA] = "gpioa",
        [STM32G474_RCC_GATE_GPIOB] = "gpiob",
        [STM32G474_RCC_GATE_GPIOC] = "gpioc",
        [STM32G474_RCC_GATE_GPIOD] = "gpiod",
        [STM32G474_RCC_GATE_GPIOE] = "gpioe",
        [STM32G474_RCC_GATE_GPIOF] = "gpiof",
        [STM32G474_RCC_GATE_GPIOG] = "gpiog",
        [STM32G474_RCC_GATE_PWR] = "pwr",
        [STM32G474_RCC_GATE_USB] = "usb",
        [STM32G474_RCC_GATE_FDCAN] = "fdcan",
        [STM32G474_RCC_GATE_USART1] = "usart1",
        [STM32G474_RCC_GATE_USART2] = "usart2",
        [STM32G474_RCC_GATE_UART4] = "uart4",
        [STM32G474_RCC_GATE_SYSCFG] = "syscfg",
    };
    Stm32g474RccState *s = STM32G474_RCC(obj);
    DeviceState *dev = DEVICE(obj);

    s->hsi16_in = qdev_init_clock_in(dev, "hsi16-in",
                                     stm32g474_rcc_input_clock_update, s,
                                     ClockUpdate);
    s->hse_in = qdev_init_clock_in(dev, "hse-in",
                                   stm32g474_rcc_input_clock_update, s,
                                   ClockUpdate);
    s->hsi48_in = qdev_init_clock_in(dev, "hsi48-in",
                                     stm32g474_rcc_input_clock_update, s,
                                     ClockUpdate);
    s->lsi_in = qdev_init_clock_in(dev, "lsi-in",
                                   stm32g474_rcc_input_clock_update, s,
                                   ClockUpdate);

    s->sysclk = qdev_init_clock_out(dev, "sysclk");
    s->hclk = qdev_init_clock_out(dev, "hclk");
    s->pclk1 = qdev_init_clock_out(dev, "pclk1");
    s->pclk2 = qdev_init_clock_out(dev, "pclk2");
    s->cortex_refclk = qdev_init_clock_out(dev, "cortex-refclk");
    s->pll_p = qdev_init_clock_out(dev, "pll-p");
    s->pll_q = qdev_init_clock_out(dev, "pll-q");
    s->pll_r = qdev_init_clock_out(dev, "pll-r");
    for (unsigned int i = 0; i < ARRAY_SIZE(gate_names); i++) {
        s->gate[i] = qdev_init_clock_out(dev, gate_names[i]);
    }

    s->reg_array = register_init_block32(
        dev, stm32g474_rcc_regs_info,
        ARRAY_SIZE(stm32g474_rcc_regs_info), s->regs_info, s->regs,
        &stm32g474_rcc_ops, false, STM32G474_RCC_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->reg_array->mem);
    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->irq);
    qdev_init_gpio_out_named(dev, s->peripheral_reset,
                             "peripheral-reset",
                             STM32G474_RCC_RESET_COUNT);
}

static void stm32g474_rcc_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    dc->realize = stm32g474_rcc_realize;
    dc->vmsd = &vmstate_stm32g474_rcc;
    dc->user_creatable = false;
    rc->phases.enter = stm32g474_rcc_reset_enter;
    rc->phases.hold = stm32g474_rcc_reset_hold;
    rc->phases.exit = stm32g474_rcc_reset_exit;
}

static const TypeInfo stm32g474_rcc_info = {
    .name = TYPE_STM32G474_RCC,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(Stm32g474RccState),
    .instance_init = stm32g474_rcc_init,
    .class_init = stm32g474_rcc_class_init,
};

static void stm32g474_rcc_register_types(void)
{
    type_register_static(&stm32g474_rcc_info);
}

type_init(stm32g474_rcc_register_types)
